<template>
  <div class="fixed left-0 top-0 w-full h-[68px] bg-black"></div>
  <main class="pt-[68px] bg-[#FAFAFA] text-[#666] text-sm leading-7">
    <div class="pb-[100px] pt-[60px] px-6 w-auto xl:w-[1030px] mx-auto">
      <h1 class="text-3xl font-semibold mb-6 text-[#333]">UGLOSS 隐私政策</h1>

      <p class="my-7">
        引言<br />
        UGLOSS是由广东火猩未来网络有限公司（以下简称"UGLOSS"或"我们"）为您提供购买商品、查询订单、查看物流、评价商品、查找售后网点、咨询在线客服的平台。<br />
        我们非常重视您的隐私。本隐私政策是针对广东火猩未来网络有限公司UGLOSS官方网站做出的隐私方面的陈述与承诺，属于《UGLOSS用户协议》的重要组成部分。涉及到UGLOSS特殊约定的，若与《UGLOSS用户协议》之间存在不一致的，以本隐私政策为准；若本隐私政策未约定的，以《UGLOSS用户协议》为准。特别是关于"未成年人信息保护、安全措施、跨境传输"等部分的约定，建议您详细阅读《UGLOSS隐私政策》。在使用我们各项产品或服务前，请您务必仔细阅读并透彻理解本政策。特别是以粗体/下划线标识的条款，请您重点阅读，在确认充分理解并同意后再开始使用。<br />
        本隐私政策在制定时充分考虑到您的需求，您全面了解我们的个人信息收集和使用惯例，同时确保您最终能控制提供给我们的个人信息，这一点至关重要。本隐私政策规定我们如何收集、使用、披露、处理、传输、提供、删除和存储您使用我们的UGLOSS时提供给我们的信息。本隐私政策下"个人信息"指通过信息本身或通过关联其他信息后能够识别特定个人的数据。我们将严格遵守本隐私政策来使用这些信息。<br />
        最后，我们希望为用户带来最好的体验。如果您对本隐私政策中描述的个人信息处理实践有任何疑问，请通过企微微信联系我们的客服，以便我们处理您的特殊需求。我们很高兴收到您的反馈。
      </p>

      <p class="my-7">
        一、我们收集哪些信息以及如何使用信息<br />
        （一）您须授权我们收集和使用您个人信息的情形<br />
        收集个人信息的目的在于向您提供产品和/或服务，并且保证我们遵守适用的相关法律、法规及其他规范性文件。您有权自行选择是否提供该信息，但多数情况下，如果您不提供，我们可能无法向您提供相应的服务，也无法回应您遇到的问题。这些功能包括：<br />
        1.实现网上购物所必须的功能 <br />
        （1）商品信息展示<br />
        为了让您快速地找到您所需要的商品，我们可能会收集您的操作系统信息来为您提供商品信息展示的最优方式。<br />
        （2）下单<br />
        当您准备对您购物车内的商品进行结算时，系统会生成您购买该商品的订单。您需要在订单中至少填写您的收货人姓名、收货地址以及电话号码，同时该订单中会载明订单号、您所购买的商品或服务信息（包括商品编号、商品名称、商品数量）、购买时间、您应支付的货款金额及支付方式。您可以另外填写收货人的固定电话、邮箱地址信息以增加更多的联系方式确保商品可以准确送达，但不填写这些信息不影响您订单的生成。此外，为了开具发票，我们需要收集您的发票抬头、纳税人识别号、发票接收电子邮箱。<br />
        上述所有信息构成您的"订单信息"。若您购买的商品或服务属于UGLOSS自营的，为帮助您实现订单相关服务，我们将使用您的订单信息来进行您的身份核验、确定交易、支付结算、完成配送、为您查询和展示订单详情以及提供客服咨询与售后服务。若您购买的商品或服务由第三方商家直接提供，且商品的配送、客服与售后服务由此类商家为您提供，则我们会将您的订单信息提供给此类商家来实现此类目的。若第三方商家委托UGLOSS提供上述的配送、客服与售后服务，我们也会使用您的订单信息来为您提供此类服务。<br />
        （3）支付功能<br />
        在您下单后，您可以选择微信支付所提供的支付服务。支付功能本身并不收集您的个人信息，但我们需要将您的订单号与交易金额信息与这些支付机构共享以实现其确认您的支付指令并完成支付。<br />
        （4）交付产品或服务功能<br />
        您知晓并同意与UGLOSS合作的第三方配送公司会在上述环节内使用您的订单信息以保证您的订购的商品能够安全送达。若您购买的商品或服务由第三方商家直接提供，或者您购买的商品存放在与UGLOSS合作的第三方物流仓库，我们会将您的订单信息提供给此类商家或第三方仓储物流服务供应商来为您交付产品或服务。<br />
        （5）客服与售后功能<br />
        我们的微信客服和售后功能会使用您的账号信息和订单信息。当您需要我们提供与您订单信息相关的客服与售后服务时，我们将会查询您的订单信息。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息，如当您要求我们变更配送地址、联系人或联系电话。为了持续为您提供售后服务，我们会保留您与客服沟通的微信聊天记录、并形成售后服务记录（包含售后工单号、售后服务类型、售后申请时间、处理结果和时间）。<br />
        1.保障交易安全所必须的功能<br />
        为提高您使用我们的产品与/或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账户安全，我们会收集您的浏览信息、历史订单信息、客户端IP地址等，用于打击刷单等不正当购买行为。此外，我们还会收集您的注册/登录时间、设备相关信息（如设备IMEI/OAID、设备型号、操作系统版本）、设备传感器信息（如设备角速度、设备加速度）、网络信息（如常用登录IP地址）来判断当前的注册、登录、交易环境是否安全。
      </p>

      <p class="my-7">
        （二）您可选择是否授权我们收集和使用您的个人信息的情形<br />
        1、为使您购物更便捷或更有乐趣，从而提升您在UGLOSS的网上购物体验，我们的以下附加功能中可能会收集和使用您的个人信息。如果您不提供这些个人信息，您依然可以进行网上购物，但您可能无法使用这些可以为您所带来购物乐趣的附加功能。这些附加功能包括：<br />
        （1）基于图片上传的附加功能：此功能将要访问您的图库，您在UGLOSS上传内容图片时，需要您授权访问您的图库。<br />
        （2）基于位置信息的附加功能：我们会收集您的位置信息（我们仅收集您当时所处的地理位置，但不会将您各时段的位置信息进行结合以判断您的行踪轨迹），在您新建和修改地址时帮助您快速选择当前地址。<br />
        （3）基于剪切板的附加功能：为了方便您填写地址，此功能将智能识别您的剪切板内容并自动填充至收货姓名、电话号码、收货地区、详细地址；此外，为了方便您参加活动，此功能将智能识别您的剪切板内容，并读取其中包含的口令、链接，以实现跳转、活动联动等功能或服务。<br />
        2、上述附加功能都是基于系统自带的功能，UGLOSS并无权限限制或提供您禁止开启或关闭附加功能。<br />
        3、参与活动<br />
        我们会推出一些营销活动，如抽奖活动、在线调查，您可以自由选择是否参与。若您参与，则视为您同意我们收集您主动向我们提供的信息，包括但不限于姓名、邮寄地址、联系号码等信息。<br />
        4、营销推广<br />
        您知悉并同意，我们可能会通过短信、电话、电子邮件和企业微信等方式向您发送营销信息。上述服务只会在符合适用法律要求，征得您的同意后发生。如您不想接收我们给您发送的营销信息，您可以通过我们提供的方式进行退订或关闭。
      </p>

      <p class="my-7">
        （三）您充分知晓，以下情形中，我们收集、使用个人信息无需征得您的同意：<br />
        1、与国家安全、国防安全有关的；<br />
        2、与公共安全、公共卫生、重大公共利益有关的；<br />
        3、与犯罪侦查、起诉、审判和判决执行等有关的；<br />
        4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；<br />
        5、所收集的个人信息是个人信息主体自行向社会公众公开的；<br />
        6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；<br />
        7、根据您的要求签订合同所必需的；<br />
        8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；<br />
        9、为合法的新闻报道所必需的；<br />
        10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
      </p>

      <p class="my-7">
        （四）我们从第三方获得您个人信息的情形<br />
        在一些法律允许的情况下，我们可能从第三方处获得您的个人信息。例如，您授权微信登录使用我们的服务或授权信息如账户、昵称等；他人执行操作和提供的涉及您的信息，比如其他用户在使用UGLOSS时填写的您的收货地址。
      </p>

      <p class="my-7">
        （五）非个人信息<br />
        我们还可能收集其他无法识别到特定个人的信息（即不属于个人信息的信息），例如您使用特定服务时产生的统计类数据，如设备相关信息、页面访问事件、页面访问时长事件、浏览行为数据等。收集此类信息的目的在于改善我们向您提供的服务。所收集信息的类别和数量取决于您如何使用我们产品和/或服务。<br />
        我们会将此类信息汇总。就本隐私政策而言，汇总数据被视为非个人信息。如果我们将非个人信息与个人信息结合使用，则在结合使用期间，此类信息将被视为个人信息。
      </p>

      <p class="my-7">
        二、与第三方服务提供商共享您的个人信息<br />
        本业务中部分服务内容由第三方服务提供商提供，为此我们需要向第三方服务提供商提供您的部分个人信息。如我们与这些第三方分享您的个人信息，我们将采取加密等手段保障您的信息安全。对我们与之共享个人信息的公司、组织，我们会对其数据安全环境进行合理审查，并与其签署严格的数据处理协议，要求第三方对您的信息采取足够的保护措施，严格遵守相关法律法规与监管要求。<br />
      </p>

      <p class="my-7">
        三、保留政策<br />
        我们基于本隐私政策中所述的信息收集的目的所必需的期间，或者遵守适用的相关法律要求保留个人信息。个人信息在完成收集目的，或在我们确认您的删除或注销申请后，或我们终止运营相应产品或服务后，我们将停止保留，并做删除或匿名化处理。如果是出于公众利益、科学、历史研究或统计的目的，我们将基于适用的法律继续保留相关数据，即使进一步的数据处理与原有的收集目的无关。<br />
        您的信息将会保存至中华人民共和国境内。
      </p>

      <p class="my-7">
        四、您的权利 <br />
        （二）您对您的个人信息享有的权利<br />
        根据您所适用的国家或地区法律法规，您有权要求访问、更正、删除我们持有的与您相关的任何个人信息（以下简称请求）。<br />
        大多数法律要求个人信息主体提出的请求应遵循特定要求，本隐私政策要求您的请求应当符合以下情形：<br />
        1、通过我们专门的请求渠道，并且出于保护您的信息安全的考虑，您的请求应当是书面的；<br />
        2、提供足够的信息使我们可以验证您的身份，确保请求人是所请求信息主体本人或合法授权人；<br />
        一旦我们获得充分信息确认可处理您的请求时，我们将在适用数据保护法律规定的时间内对您的请求做出回应。具体而言：<br />
        1、基于您的要求及适用法律规定，我们可免费提供一份我们已收集并处理的关于您的个人信息记录，<br />
        如您提出对于相关信息的其他请求，我们可能会基于相关适用法律，并结合实际的管理成本向您收取一笔合理的费用。<br />
        2、如果您认为我们持有的关于您的任何信息是不正确或不完整的，可要求基于使用目的更正或完善个人信息。<br />
        3、根据您适用的法律法规，您可能有权要求我们删除您的个人数据。我们将会根据您的删除请求进行评估，若满足相应规定，我们将会采取包括技术手段在内的相应步骤进行处理。当您或我们协助您删除相关信息后，因为适用的法律和安全技术，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并将其与任何进一步处理隔离，直到备份可以清除或实现匿名。例如，根据《中华人民共和国电子商务法》，您的商品和服务信息、交易信息保存时间自交易完成之日起不得少于三年。<br />
        我们有权拒绝处理无实质意义/纠缠式重复的请求、损害他人隐私权的请求、极端不现实的请求，要求不相称的技术工作，以及根据当地法律无需给予的请求，已经公之于众的信息，保密条件下给出的信息。如果我们认为删除数据或访问数据的请求的某些方面可能会导致我们无法出于前述反欺诈和安全目的合法使用数据，可能也会予以拒绝。
      </p>

      <p class="my-7">
        五、第三方网站和服务<br />
        我们的隐私政策不适用于第三方提供的产品或服务。取决于您所使用的UGLOSS的产品或服务，其中可能包括第三方的产品或服务，涉及支付、定位、分享等类型，其中一些会以第三方网站的链接形式提供，还有一些会以SDK、API等形式接入。当您使用这些产品或服务时，也可能收集您的信息。因此，我们强烈建议您花时间阅读该第三方的隐私政策，就像阅读我们的政策一样。我们不对第三方如何使用他们向您收集的个人信息负责，也不能控制其使用。我们的隐私政策不适用通过我们的服务链接的其他网站。
      </p>

      <p class="my-7">
        六、联系我们<br />
        如果您对本隐私政策有任何意见或问题，或者您对我们收集、使用或披露您的个人信息有任何问题，请通过下企业微信联系UGLOSS客服，并提及"隐私政策"。针对您关于个人信息相关的权利请求、问题咨询等时，我们有专业的团队解决你的问题。如果你的问题本身涉及比较重大的事项，我们可能会要求你提供更多信息。如果您对收到的答复不满意，您可以将投诉移交给所在司法辖区的相关监管机构。如果您咨询我们，我们会根据您的实际情况，提供可能适用的相关投诉途径的信息。<br />
        联系地址：广州市番禺区南村镇汉溪大道东362号3801号、3806号、3807号<br />
        电子邮箱：huoxing@ugloss.com 联系电话：(020) 3112 5150
      </p>
    </div>
    <Copyright class="pt-9 pb-16 border-t-2 border-black" />
  </main>
</template>

<script setup>
import Copyright from "~/components/Copyright.vue";

definePageMeta({
  title: "隐私政策",
});

// onMounted(() => {
//   document.querySelector("nav").classList.add("sm:mix-blend-difference");
// });

// onUnmounted(() => {
//   document.querySelector("nav").classList.remove("sm:mix-blend-difference");
// });
</script>
