<template>
  <div class="fixed left-0 top-0 w-full h-[68px] bg-black"></div>
  <main class="pt-[68px] bg-[#FAFAFA] text-[#666] text-sm leading-7">
    <div class="pb-[100px] pt-[60px] px-6 w-auto xl:w-[1030px] mx-auto">
      <h1 class="text-3xl font-semibold mb-6 text-[#333]">UGLOSS 用户协议</h1>
      <p>
        欢迎使用UGLOSS平台提供的服务，《UGLOSS用户协议》（以下简称“本协议”）是您（或称“用户”，指注册、登录及使用本服务的个人或组织）与UGLOSS平台运营公司之间关于UGLOSS（简称“本平台”)与UGLOSS提供的产品、程序及服务所订立的协议。<br />
        【审慎阅读】UGLOSS在此特别提醒您认真阅读、充分理解本协议中各条款，特别是免除或者限制责任的条款、法律适用和管辖条款，尤此类条款将以加粗的形式提示。UGLOSS平台的法律声明、平台规范、通知、公告、针对个别商品或服务所公示的规则等均为本协议的组成部分，与本协议不可分割且具有同等法律效力。
        如您同意本协议并完成全部注册程序，即表示您已充分阅读、理解并接受本协议的全部内容，并与UGLOSS之间达成一致，成为UGLOSS用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止访问UGLOSS网站和/或使用UGLOSS服务。
      </p>

      <p class="my-7">
        一、定义<br />
        UGLOSS是广东火猩未来网络有限公司运营的网络交易平台，为所有用户提供网络交易场所、技术支持及平台服务等网站、客户端及微信小程序。本协议项下，UGLOSS平台运营主体可能根据平台业务调整而发生变更，变更后的平台运营主体与您共同履行本协议并向您提供服务，UGLOSS平台运营主体的变更不会影响您本协议项下的权益。
      </p>

      <p class="my-7">
        二、用户使用规则<br />
        2.1【帐号注册】您无需用户帐号即可浏览本平台。如果您想使用本平台更多功能与服务，您必须注册UGLOSS帐号，您对UGLOSS帐号的注册、使用行为应符合《UGLOSS帐号使用协议》。<br />
        2.2【隐私政策】在任何时候，您的个人信息均依照广东火猩未来网络有限公司的隐私政策处理，该政策也是本协议不可分割的一部分。<br />
        2.3【用户资格】在注册、登录及使用UGLOSS平台服务过程中，用户应当是具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您应当在您的监护人的参与下使用本款软件，您及您的监护人应依照法律规定承担因此而导致的一切后果。<br />
        此外，您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用平台服务。<br />
        2.4【禁止性信息】您将不会通过平台发送或传播含有法律、行政法规禁止性信息。否则，UGLOSS可对您发布的信息依法或依本协议进行删除或屏蔽，并有权视情节采取警告、限期改正、暂停服务、取消订单、禁止交易等措施。此类信息包括但不限于：<br />
        （1）反对宪法所确定的基本原则的；<br />
        （2）危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一、损害国家荣誉和利益的；<br />
        （3）煽动民族仇恨、民族歧视，破坏民族团结的；<br />
        （4）破坏国家宗教政策，宣扬邪教和封建迷信的；<br />
        （5）散布谣言，扰乱社会秩序，破坏社会稳定的；<br />
        （6）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br />
        （7）恐吓、侮辱、攻击、诽谤他人，侵害他人合法权益的；<br />
        （8）利用本平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动的；<br />
        （9）发布任何侵犯他人著作权、商标权等知识产权及其他合法权利的；<br />
        （10）含有法律、行政法规禁止的其他内容的。
      </p>

      <p class="my-7">
        三、平台服务规范<br />
        3.1【商品购买】UGLOSS是网络交易平台，并对其在UGLOSS的经营活动独立承担法律责任，平台不承担前述义务及责任，但法律法规另有规定除外。<br />
        3.2【商品缺货】由于市场变化及各种以合理商业努力难以控制的因素的影响，如您提交的订单信息中选购的商品无相应库存，您有权取消该商品订单。若您已经付款，则由UGLOSS为您办理退款。订单取消后，您已支付的款项将退回您的付款账户。您理解并认可，退款时间会因不同支付平台、支付方式等原因而有差异。<br />
        3.3【商品区域限制】UGLOSS平台上提供的部分商品可能仅限于在中国大陆地区使用，因其在包装、产品制式、市场准入要求、质量认证、语言、用户使用习惯、维保服务等方面仅能满足中国大陆地区有关法律法规的要求。用户若将商品带往中国大陆地区以外的其他国家或地区，则可能因产品制式、用户使用习惯等方面的差异使商品无法在当地正常使用，也无法在当地接受售后服务。<br />
        3.4【先款后货】UGLOSS实行先付款后发货的方式，用户及时、足额、合法的支付选购商品所需的款项是UGLOSS给用户发货的前提。付款方式将在UGLOSS平台予以公示。用户应在确认订单时，选择付款方式，并严格按照已选择的方式付款。用户未能按照所选择的方式或在指定时间完成付款的，UGLOSS有权取消订单。<br />
        3.5【支付】用户有权选择使用UGLOSS提供的支付方式，用户理解并确认支付服务由具备合法资质的第三方为用户提供，该等支付服务的使用条件及规范由用户与支付服务提供方确定，与UGLOSS无关。<br />
        3.6【订单成立】UGLOSS平台上展示的商品及其价格、规格等信息仅供用户浏览参考，用户下单时须填写希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址等具体内容，系统将根据用户填写的前述必要信息自动生成相应订单，用户确认无误后可提交订单。您在UGLOSS平台上提交订单并付清全款后，方视为您与UGLOSS之间就您已付款的商品建立了合同关系。在您的订单成立之前，您与UGLOSS均有权取消相关产品的订单。<br />
        3.7【价格显示】商品价格以用户下单时页面显示为准。<br />
        尽管UGLOSS尽最大的努力以确保商品价格的准确性，但是商品价格偶尔会有标价错误。如果某一商品的正确定价高于UGLOSS平台显示的标价，或者由于系统结算错误导致订单价格有误，UGLOSS有权根据具体情况与您进行沟通，或者取消您的订单、解除合同并通知您。<br />
        3.8【信息监控】UGLOSS平台上的商品和服务的价格、数量等信息随时可能发生变动，平台有权对商品信息进行及时的监测、修改或删除。如UGLOSS发现相关页面上包括但不限于商品名称、价格或数量价格等关键信息存在标注错误的，UGLOSS有权进行调整。鉴于平台上商品和服务信息数量极其庞大，虽然UGLOSS会尽最大努力保证用户所浏览商品/服务信息的准确性，但无法逐一审查商品及/或服务的信息，无法逐一审查交易所涉及的商品及/或服务的质量、安全以及合法性、真实性、准确性，对此您应谨慎判断。<br />
        3.9【限制转售】鉴于UGLOSS是向个人消费者提供产品和服务用于其生活消费的网络交易平台，因此用户不能利用平台进行批量转售，批量转售行为是指批量购买平台提供的商品并将其转售给直接客户的行为。用户如有上述行为，UGLOSS有权采取包括但不限于取消订单、禁止交易、删除帐号等措施，同时保留追究违约用户法律责任的权利。<br />
        3.10【恶意购买】在商品未出库或未签收之前,<br />
        若发生以下任一情形，UGLOSS有权单方面原路退款到支付人账户，并取消订单：<br />
        （1）订单为非正常流程产生，包括但不限于违规参与限购活动、以非法软件破坏订单生成程序等；<br />
        （2）订单生成后，因该用户的帐号权属产生争议或纠纷，当事人无法就争议达成一致，并且UGLOSS收到相关凭证；<br />
        （3）通过不正当手段（如外挂工具、网络攻击等）下单谋取利益；<br />
        （4）订购人的用户帐号违反限购规定，或在一段时间内通过多个用户帐号下单，虽然单个帐号未违反限购规定，但通过订单的金融支付帐号、收货地址、下单IP地址、联系电话等判断实际购买人为一人或与此人有紧密关联，且多笔订单合计购买数量违反限购规定的；<br />
        （5）其它UGLOSS认为通过不正当手段进行刷单的情形。<br />
        3.11【优惠券使用】用户购买产品时所使用的F码、特权购及优惠券，一经使用即无效，在任何情形下均不再退回至用户账户。关于优惠券是否因使用而无效，如有特殊使用规则，则按照特殊规则处理。<br />
        3.12【买赠活动】用户退货时应当将商品本身、配件及赠品一并退回。赠品包括赠送的实物、积分、代金券、优惠券等。如果赠品不能一并退回，您应当按照UGLOSS的要求支付相应赠品价款。<br />
        3.13【评价规则】UGLOSS保留删除平台上各类不符合法律法规或不真实或与本次购买商品行为无关的信息内容。<br />
        3.14【收货信息】为了快速准确地进行商品配送，用户需填写详细准确的收货人姓名、收货人电话、收货地址等信息，并保持通信工具畅通。如果因为您填写的收货人姓名、收货人电话、收货地址等信息错误，由此造成的损失全部由用户自行承担。因如下情况造成订单延迟配送或无法配送的，UGLOSS不承担配送责任，并保留单方取消订单的权利：<br />
        （1）用户提供的收货信息不真实、不准确或不完整；
        （2）货物送达后无人签收；<br />
        （3）和收货人联系不上时，如收货人电话停机或不接听电话；<br />
        （4）第三方原因或不可抗力因素导致的，例如：自然灾害、交通戒严、骚乱、突发战争等。<br />
        3.15【送货时间】系统会根据不同订单类型而确定是否推送及显示送货时间，如有显示，则订单信息中列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出，不属于承诺到货时间，也不等于实际到货或完成安装时间。您知悉平台上因缺货造成的产品送达迟延，或因为交通、天气、政府原因、大型活动等不可抗力及第三方原因延误，建议您登录UGLOSS，到订单详情页关注配送进度。您理解并接受对于前述配送延迟情形，UGLOSS对此不承担配送延迟责任。<br />
        3.16【特殊商品配送】对于众筹等特殊活动商品，会在UGLOSS承诺的期限内按照下单顺序安排发货，但由于生产周期较长，部分商品可能出现延迟发货的情形。<br />
        3.17【售后服务】UGLOSS将根据国家法律法规相关规定及UGLOSS平台上公布的售后规则向用户提供售后保障。同时，UGLOSS平台仅在中国大陆地区向您提供售后服务，如您携带在UGLOSS平台购买的商品出关，UGLOSS无义务提供任何协助出关的任何信息。<br />
        3.18【关于跨境商品的特别规定】如您在UGLOSS购买跨境商品的，您了解并同意：<br />
        3.18.1根据国家相关的监管法律法规，您委托UGLOSS接入的第三方支付机构向其合作银行发送购买外汇的请求并将相关支付信息及支付账户实名认证信息（包括姓名及身份证号码等）发送给UGLOSS。因此您还需同意该第三方支付机构需要您确认的相关协议，并承担由此所产生的法律后果。<br />
        3.18.2
        您因使用UGLOSS而发生的所有应纳税赋以及其它方面的费用均由您自行支付。您保证遵守《海关法》和国家相关法律法规，在UGLOSS购买的商品均为您个人合理自用，您愿意接受海关、检验检疫机构及其他监管部门的监管，并承担相应法律责任。<br />
        3.18.3
        跨境电子商务零售进口商品的单次交易限值与年度交易限值按照国家相关政策执行，如因超过上述限值而产生的所有后果（包括但不限于清关失败等）及法律责任均由您自行承担，如因此给UGLOSS造成任何损失的，UGLOSS有权向您追偿。<br />
        3.18.4相关商品符合原产地有关质量、安全、卫生、环保、标识等标准或技术规范要求，但可能与我国标准存在差异，消费者自行承担相关风险。<br />
        3.18.5 相关商品直接购自境外，可能无中文标签。<br />
        3.18.6 消费者购买的商品仅限个人自用，不得再次销售。<br />
        3.18.7
        您在购买前应当认真、详细阅读平台上的消费者风险告知书内容，结合自身风险承担能力做出判断，同意消费者风险告知书内容后方可下单购买。<br />
        3.19【调处决定】在争议调处过程中，调处人员并非专业人士，仅是基于用户委托以中立第三方身份进行争议处理，可能无法保证处理结果符合用户的预期，您可以通过法律程序寻求救济措施。
      </p>

      <p class="my-7">
        四、用户信息保护及授权<br />
        4.1【个人信息保护】UGLOSS将按照隐私政策收集、使用、处理您的个人信息。按照适用法律，对于您的个人信息，您享有查询、更正、删除以及注销服务或帐号的权利，具体流程请参见隐私政策。<br />
        4.2【信息保存】个人信息在完成收集目的后，UGLOSS将停止保留数据，或进行脱敏、去标识化处理。但是按照《中华人民共和国电子商务法》的相关规定，UGLOSS应当保存交易信息至交易完成之日起三年，但UGLOSS不会再处理您的此部分交易信息，法律、行政法规另有规定除外。<br />
        4.3【信息披露】我们不会与UGLOSS（及相关关联公司或者相关服务提供的主体）以外的任何公司、组织和个人共享您的个人信息，但以下情况除外：<br />
        （1）事先获得您明确的同意或授权；<br />
        （2）根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下进行提供，包括但不限于有关主管部门按照《中华人民共和国电子商务法》要求UGLOSS提供有关电子商务数据信息（其中包含部分个人信息）的。<br />
        4.4【微信小程序】在特定场景下用户可以选择用自己已有的微信帐号登录UGLOSS，用户使用以上帐号登录并关联UGLOSS帐号，UGLOSS会获取一些用户在这些平台上的信息。鉴于此，用户在进行以上操作时代表您已同意UGLOSS获取您在这些门户网站、社交平台上的信息。<br />
        4.5【授权使用】对于您提供、发布及在使用UGLOSS平台服务中形成的除个人信息外的文字、图片、视频、音频等非个人信息，在法律规定的保护期限内您免费授予UGLOSS及其关联公司获得全球排他的许可使用权利及再授权给其他第三方使用并可以自身名义对第三方侵权行为取证及提起诉讼的权利。您同意UGLOSS及其关联公司存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的非个人信息或制作其派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。<br />
        为方便您使用UGLOSS平台等其他相关服务，您授权UGLOSS将您在账户注册和使用UGLOSS平台服务过程中提供、形成的信息传递给其他相关服务提供者，或从其他相关服务提供者获取您在注册、使用相关服务期间提供、形成的信息。
      </p>

      <p class="my-7">
        五、免责声明<br />
        5.1【出口管制】UGLOSS有权拒绝向被联合国、美国、欧盟及其他国家的列入黑名单的国家、地区及任何机构或个人发送违禁商品。同时，您不得将任何UGLOSS生产或销售的产品用于任何军事用途、支持恐怖主义、核设施、生化武器、导弹、大规模杀伤性武器等。您必须遵守可能对商品、软件、技术及服务所适用的美国或其他国家的所有出口及再出口限制。如果您受制于美国的制裁，或受制于您正在使用的UGLOSS服务所在地之国家政府施行的、与美国法律一致的制裁，您有可能无法使用UGLOSS提供的服务。<br />
        5.2【谨慎交易】在您未发出明确的服务需求的情形下，UGLOSS不会主动以电话或其他形式主动向您提供有偿服务，如您接受上述服务，UGLOSS对该服务不承担任何责任。<br />
        5.3【不可抗力及第三方原因】UGLOSS依照法律规定履行相关义务，但对于因不能预见、不能避免且不能克服的原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，UGLOSS并不承担违约责任，具体情况包括但不限于：<br />
        （1）不可抗力事件，包括但不限于雷电、干旱、火灾、地震、火山爆发、山崩、滑坡、水灾、暴风雨、海啸、台风或龙卷风等自然灾害；流行病、饥荒、瘟疫等突发公共卫生事件；战争行为（无论是否宣战）、入侵、武装冲突或外敌行为、封锁或军事力量的使用、禁运、暴乱或民众骚乱、恐怖行为、军事演习或政变；政府行为、司法行政命令；不能合理预见的重大交通阻滞或停运；化学或放射性污染或核辐射。<br />
        （2）第三方原因导致的影响互联网正常运行的情形，包括但不限于电力供应故障、通讯网络故障等公共服务因素；电信部门技术调整导致之重大影响；黑客攻击；电脑病毒侵袭；网络故障、带宽、域名解析故障；非法内容信息、骚扰信息的屏蔽；网络故障、带宽、域名解析故障；网络设备或技术提供商的服务延迟、服务障碍；政府管制以及其他任何网络、技术、通信线路、信息安全管理措施等原因造成的服务中断、受阻。<br />
        （3）在甲方已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素导致的合同履行困难的情况。
      </p>

      <p class="my-7">
        六、知识产权<br />
        6.1【知识产权保护】您使用UGLOSS帐号及UGLOSS平台服务的行为应符合《UGLOSS帐号使用协议》等相关协议关于知识产权的约定。<br />
        6.2【知识产权许可】您在使用UGLOSS平台服务时利用UGLOSS帐号发表上传的文字、图片、视频、软件以及表演等原创信息的知识产权归您所有，但是您确认您对该等信息的发表、上传行为视同为对UGLOSS非独占地、永久地、不可撤销地授予该等信息相关全部知识产权的使用、复制等权利，并且您同意UGLOSS可转授权上述权利。<br />
        6.3【知识产权归属】除非经过UGLOSS的在先书面同意，您未获得权利使用UGLOSS的任何知识产权。您保证、陈述并承诺您尊重UGLOSS的知识产权。您不会以自己名义或促使第三方，也不会同意或放任任何第三方，为了其任何营销、广告、促销或其他目的，在任何法域、以任何方式申请与UGLOSS或UGLOSS关联公司商标相似的商标、域名、无线网站、互联网搜索词或任何商号、服务标志。如出现上述情况，您须将所有相关权利转让给UGLOSS，费用由您承担。如因您违反本条款约定而给UGLOSS造成损失的，该损失全部由您承担。<br />
        6.4【侵权处理】您在UGLOSS发布的信息不得侵犯任何第三人的知识产权，未经具有相关所有权人之事先书面同意，您不得以任何方式上传、发布、修改、传播或复制任何受著作权保护的材料、商标或属于其他人的专有信息。如您认为UGLOSS平台上的商品或其他信息侵犯了您的知识产权，请按照UGLOSS平台上公布的知识产权保护规则及流程处理。
      </p>

      <p class="my-7">
        七、变更与终止<br />
        7.1【变更】UGLOSS可根据国家法律法规变化及维护交易秩序、保护消费者权益需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过法定程序并以合理方式通知您。如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用UGLOSS平台服务，变更事项对您不产生效力；如您在变更事项生效后仍继续使用UGLOSS平台服务，则视为您同意已生效的变更事项。<br />
        7.2【终止】当您发生以下任一情况时，UGLOSS平台有权限制您的全部或部分权限（包括但不限于下单、参加促销活动等），取消相关未履行完毕的订单、解除合同，或者注销您的UGLOSS帐号：<br />
        （1）通过网络攻击、大量发布广告等行为影响网站正常经营或影响网站为其他用户提供服务；<br />
        （2）多次在评论区或咨询区发布与所售商品或服务无关的信息，或多次恶意进行负面评价，违反平台信用评价制度的；<br />
        （3）通过不正当手段（如外挂工具、网络攻击、盗刷银行卡等方式）或其他违法、侵犯第三人利益的方式谋取利益；<br />
        （4）利用销售方过错或失误进行恶意索赔、投诉达两次或以上，或者无故对客服人员进行辱骂、人身攻击；<br />
        （5）非因商品/服务质量原因，短期内多次拒收商品或拒绝接受服务；<br />
        （6）通过帐号从事索赔或转售业务的（如批发、零售）；<br />
        （7）您提供的订单信息（包括但不限于姓名、电话、身份证号、电子邮箱等）不真实、不准确或不完整；<br />
        （8）您有其他影响平台正常经营秩序或违法行为。
      </p>

      <p>
        八、其他<br />
        8.1【有效联系方式】您应该提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使通知无法送达或未及时送达，由您自行承担由此可能产生的法律后果。<br />
        8.2【通知】UGLOSS向您浏览界面推送的弹窗等通知形式，也作为向您发出的有效通知。UGLOSS将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。<br />
        8.3【法律适用】本协议适用中华人民共和国法律。<br />
        8.4【管辖】如果双方发生纠纷，应本着友好的原则协商解决；如协商不成，应向被告所在地有管辖权的法院提起诉讼。<br />
        8.5【独立性】若本协议中的某些条款因故无法适用，不影响本协议的其他条款继续适用。
      </p>
    </div>
    <Copyright class="pt-9 pb-16 border-t-2 border-black" />
  </main>
</template>

<script setup>
import Copyright from "~/components/Copyright.vue";

definePageMeta({
  title: "用户协议",
});

// onMounted(() => {
//   document.querySelector("nav").classList.add("sm:mix-blend-difference");
// });

// onUnmounted(() => {
//   document.querySelector("nav").classList.remove("sm:mix-blend-difference");
// });
</script>
